
### :robot: Terraform Report
---
##### Plan: `2` to add, `2` to change, `2` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # github_actions_repository_permissions.this["image-operator"] will be updated in-place
  ~ resource "github_actions_repository_permissions" "this" {
        id              = "skopeo-operator"
      ~ repository      = "skopeo-operator" -> "image-operator"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_branch_protection.this["image-operator"] must be replaced
-/+ resource "github_branch_protection" "this" {
      - force_push_bypassers            = [] -> null
      ~ id                              = "BPR_kwDONCkm_s4DUUyo" -> (known after apply)
      ~ repository_id                   = "skopeo-operator" -> "image-operator" # forces replacement
        # (8 unchanged attributes hidden)

      ~ required_status_checks {
          - contexts = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

  # github_repository.repositories["image-operator"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ full_name                   = "Tchoupinax/image-operator" -> (known after apply)
      - homepage_url                = "https://tchoupinax.github.io/image-operator/" -> null
        id                          = "skopeo-operator"
      ~ name                        = "skopeo-operator" -> "image-operator"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # github_repository_file.renovate_json["image-operator"] must be replaced
-/+ resource "github_repository_file" "renovate_json" {
      + autocreate_branch_source_sha = (known after apply)
      ~ commit_sha                   = "1db5162e8ab37d9897f237f433799306d659f1ec" -> (known after apply)
      ~ id                           = "skopeo-operator/renovate.json" -> (known after apply)
      ~ ref                          = "master" -> (known after apply)
      ~ repository                   = "skopeo-operator" -> "image-operator" # forces replacement
      ~ sha                          = "3a190a106c4f0bc1eb6048962e377458707582dc" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#11627920784`](https://github.com/Tchoupinax/repo-config/actions/runs/11627920784) - commit 20416eb50ed0a525436b5bee2204e762a4eab5c5
